# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]

  m: [0.50, 1.00, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [24, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [24, 3, 2]] # 1-P2/4
  - [-1, 2, StarBlock, [4]]
  - [-1, 1, Conv, [48, 3, 2]] # 3-P3/8
  - [-1, 2, StarBlock, [4]]
  - [-1, 1, SCDown, [96, 3, 2]] # 5-P4/16
  - [-1, 8, StarBlock, [4]]
  - [-1, 1, SCDown, [192, 3, 2]] # 7-P5/32
  - [-1, 3, StarBlock, [4]]
  - [-1, 1, SPPF, [192, 5]] # 9
  - [-1, 1, C2PSA, [192]] # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [96, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [48, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [48, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [96, False]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [96, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [192, True]] # 13 # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

